7767517
256 304
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 4 in0 1 2 3 4
MemoryData               pnnx_fold_mean0.1        0 1 5 0=1 1=1 2=3
MemoryData               pnnx_fold_std0.1         0 1 6 0=1 1=1 2=3
BinaryOp                 sub_0                    2 1 4 5 7 0=1
BinaryOp                 div_1                    2 1 7 6 8 0=3
Convolution              conv_12                  1 1 8 9 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_83                1 1 9 10 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_1              1 2 10 11 12
ConvolutionDepthWise     convdwrelu_0             1 1 12 13 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_13                  1 1 13 14 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
BinaryOp                 add_2                    2 1 14 11 15 0=0
Split                    splitncnn_2              1 2 15 16 17
Convolution              convrelu_0               1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 18 19 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              conv_15                  1 1 19 20 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Split                    splitncnn_3              1 2 20 21 22
Convolution              convrelu_1               1 1 22 23 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 23 24 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=648 7=72 9=1
Convolution              conv_17                  1 1 24 25 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
BinaryOp                 add_3                    2 1 25 21 26 0=0
Split                    splitncnn_4              1 2 26 27 28
Convolution              convrelu_2               1 1 28 29 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 29 30 0=72 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=1800 7=72 9=1
Split                    splitncnn_5              1 2 30 31 32
Pooling                  gap_0                    1 1 32 33 0=1 4=1
Convolution              convrelu_3               1 1 33 34 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728 9=1
Convolution              conv_20                  1 1 34 35 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
HardSigmoid              hsigmoid_75              1 1 35 36 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_141              1 1 36 37 0=1 1=1 2=-1
BinaryOp                 mul_4                    2 1 37 31 38 0=2
Convolution              conv_21                  1 1 38 39 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2880
Split                    splitncnn_6              1 2 39 40 41
Convolution              convrelu_4               1 1 41 42 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 42 43 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120 9=1
Split                    splitncnn_7              1 2 43 44 45
Pooling                  gap_1                    1 1 45 46 0=1 4=1
Convolution              convrelu_5               1 1 46 47 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840 9=1
Convolution              conv_24                  1 1 47 48 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSigmoid              hsigmoid_76              1 1 48 49 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_142              1 1 49 50 0=1 1=1 2=-1
BinaryOp                 mul_5                    2 1 50 44 51 0=2
Convolution              conv_25                  1 1 51 52 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
BinaryOp                 add_6                    2 1 52 40 53 0=0
Split                    splitncnn_8              1 2 53 54 55
Convolution              convrelu_6               1 1 55 56 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 56 57 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120 9=1
Split                    splitncnn_9              1 2 57 58 59
Pooling                  gap_2                    1 1 59 60 0=1 4=1
Convolution              convrelu_7               1 1 60 61 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840 9=1
Convolution              conv_28                  1 1 61 62 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSigmoid              hsigmoid_77              1 1 62 63 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_143              1 1 63 64 0=1 1=1 2=-1
BinaryOp                 mul_7                    2 1 64 58 65 0=2
Convolution              conv_29                  1 1 65 66 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
BinaryOp                 add_8                    2 1 66 54 67 0=0
Split                    splitncnn_10             1 2 67 68 69
Convolution              conv_30                  1 1 69 70 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_84                1 1 70 71 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_159               1 1 71 72 0=240 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2160 7=240
HardSwish                hswish_85                1 1 72 73 0=1.666667e-01 1=5.000000e-01
Convolution              conv_31                  1 1 73 74 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=19200
Split                    splitncnn_11             1 2 74 75 76
Convolution              conv_32                  1 1 76 77 0=200 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16000
HardSwish                hswish_86                1 1 77 78 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_160               1 1 78 79 0=200 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1800 7=200
HardSwish                hswish_87                1 1 79 80 0=1.666667e-01 1=5.000000e-01
Convolution              conv_33                  1 1 80 81 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16000
BinaryOp                 add_9                    2 1 81 75 82 0=0
Split                    splitncnn_12             1 2 82 83 84
Convolution              conv_34                  1 1 84 85 0=184 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
HardSwish                hswish_88                1 1 85 86 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_161               1 1 86 87 0=184 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1656 7=184
HardSwish                hswish_89                1 1 87 88 0=1.666667e-01 1=5.000000e-01
Convolution              conv_35                  1 1 88 89 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
BinaryOp                 add_10                   2 1 89 83 90 0=0
Split                    splitncnn_13             1 2 90 91 92
Convolution              conv_36                  1 1 92 93 0=184 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
HardSwish                hswish_90                1 1 93 94 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_162               1 1 94 95 0=184 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1656 7=184
HardSwish                hswish_91                1 1 95 96 0=1.666667e-01 1=5.000000e-01
Convolution              conv_37                  1 1 96 97 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
BinaryOp                 add_11                   2 1 97 91 98 0=0
Convolution              conv_38                  1 1 98 99 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
HardSwish                hswish_92                1 1 99 100 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_163               1 1 100 101 0=480 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4320 7=480
HardSwish                hswish_93                1 1 101 102 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_14             1 2 102 103 104
Pooling                  gap_3                    1 1 104 105 0=1 4=1
Convolution              convrelu_8               1 1 105 106 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              conv_40                  1 1 106 107 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
HardSigmoid              hsigmoid_78              1 1 107 108 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_144              1 1 108 109 0=1 1=1 2=-1
BinaryOp                 mul_12                   2 1 109 103 110 0=2
Convolution              conv_41                  1 1 110 111 0=112 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53760
Split                    splitncnn_15             1 2 111 112 113
Convolution              conv_42                  1 1 113 114 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=75264
HardSwish                hswish_94                1 1 114 115 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_164               1 1 115 116 0=672 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6048 7=672
HardSwish                hswish_95                1 1 116 117 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_16             1 2 117 118 119
Pooling                  gap_4                    1 1 119 120 0=1 4=1
Convolution              convrelu_9               1 1 120 121 0=168 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896 9=1
Convolution              conv_44                  1 1 121 122 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896
HardSigmoid              hsigmoid_79              1 1 122 123 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_145              1 1 123 124 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 124 118 125 0=2
Convolution              conv_45                  1 1 125 126 0=112 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=75264
BinaryOp                 add_14                   2 1 126 112 127 0=0
Convolution              conv_46                  1 1 127 128 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=75264
HardSwish                hswish_96                1 1 128 129 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_165               1 1 129 130 0=672 1=5 11=5 12=2 13=1 14=4 2=2 3=1 4=4 5=1 6=16800 7=672
HardSwish                hswish_97                1 1 130 131 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_17             1 2 131 132 133
Pooling                  gap_5                    1 1 133 134 0=1 4=1
Convolution              convrelu_10              1 1 134 135 0=168 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896 9=1
Convolution              conv_48                  1 1 135 136 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896
HardSigmoid              hsigmoid_80              1 1 136 137 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_146              1 1 137 138 0=1 1=1 2=-1
BinaryOp                 mul_15                   2 1 138 132 139 0=2
Convolution              conv_49                  1 1 139 140 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=107520
Split                    splitncnn_18             1 2 140 141 142
Convolution              conv_50                  1 1 142 143 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
HardSwish                hswish_98                1 1 143 144 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_166               1 1 144 145 0=960 1=5 11=5 12=2 13=1 14=4 2=2 3=1 4=4 5=1 6=24000 7=960
HardSwish                hswish_99                1 1 145 146 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_19             1 2 146 147 148
Pooling                  gap_6                    1 1 148 149 0=1 4=1
Convolution              convrelu_11              1 1 149 150 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400 9=1
Convolution              conv_52                  1 1 150 151 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
HardSigmoid              hsigmoid_81              1 1 151 152 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_147              1 1 152 153 0=1 1=1 2=-1
BinaryOp                 mul_16                   2 1 153 147 154 0=2
Convolution              conv_53                  1 1 154 155 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_17                   2 1 155 141 156 0=0
Split                    splitncnn_20             1 2 156 157 158
Convolution              conv_54                  1 1 158 159 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
HardSwish                hswish_100               1 1 159 160 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_167               1 1 160 161 0=960 1=5 11=5 12=2 13=1 14=4 2=2 3=1 4=4 5=1 6=24000 7=960
HardSwish                hswish_101               1 1 161 162 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_21             1 2 162 163 164
Pooling                  gap_7                    1 1 164 165 0=1 4=1
Convolution              convrelu_12              1 1 165 166 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400 9=1
Convolution              conv_56                  1 1 166 167 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
HardSigmoid              hsigmoid_82              1 1 167 168 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_148              1 1 168 169 0=1 1=1 2=-1
BinaryOp                 mul_18                   2 1 169 163 170 0=2
Convolution              conv_57                  1 1 170 171 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_19                   2 1 171 157 172 0=0
Convolution              conv_58                  1 1 172 173 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
HardSwish                hswish_102               1 1 173 174 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_22             1 2 174 175 176
Pooling                  gap_8                    1 1 175 177 0=1 4=1
Convolution              convsigmoid_19           1 1 177 178 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=122880 9=4
Reshape                  reshape_149              1 1 178 179 0=1 1=1 2=-1
Convolution              convrelu_13              1 1 176 180 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=122880 9=1
BinaryOp                 mul_20                   2 1 180 179 181 0=2
Slice                    split_0                  1 2 181 182 183 -23300=2,64,-233 1=0
Split                    splitncnn_23             1 2 183 184 185
MemoryData               pnnx_fold_h.2            0 1 186 0=32 1=32 2=64
MemoryData               pnnx_fold_h.2_2          0 1 187 0=32 1=32 2=64
MemoryData               pnnx_fold_h.2_1          0 1 188 0=32 1=32 2=64
Concat                   cat_0                    2 1 184 186 189 0=0
Convolution              convsigmoid_20           1 1 189 190 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=4
Slice                    split_1                  1 2 190 191 192 -23300=2,64,-233 1=0
Split                    splitncnn_24             1 2 192 193 194
BinaryOp                 mul_21                   2 1 191 188 195 0=2
Concat                   cat_1                    2 1 185 195 196 0=0
Convolution              conv_62                  1 1 196 197 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
TanH                     tanh_133                 1 1 197 198
BinaryOp                 mul_22                   2 1 193 198 199 0=2
BinaryOp                 sub_23                   1 1 194 200 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_24                   2 1 200 187 201 0=2
BinaryOp                 add_25                   2 1 201 199 202 0=0
Split                    splitncnn_25             1 2 202 203 out5
Concat                   cat_2                    2 1 182 203 205 0=0
Pooling                  avgpool2d_9              1 1 3 206 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=0 6=0
Split                    splitncnn_26             1 2 206 207 208
Pooling                  avgpool2d_10             1 1 208 209 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=0 6=0
Split                    splitncnn_27             1 2 209 210 211
Pooling                  avgpool2d_11             1 1 211 212 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=0 6=0
Interp                   upsample_137             1 1 205 213 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_3                    3 1 213 68 212 214 0=0
Convolution              convrelu_14              1 1 214 215 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=123120 9=1
Slice                    split_2                  1 2 215 216 217 -23300=2,40,-233 1=0
Split                    splitncnn_28             1 2 217 218 219
MemoryData               pnnx_fold_h.4            0 1 220 0=64 1=64 2=40
MemoryData               pnnx_fold_h.4_2          0 1 221 0=64 1=64 2=40
MemoryData               pnnx_fold_h.4_1          0 1 222 0=64 1=64 2=40
Concat                   cat_4                    2 1 218 220 223 0=0
Convolution              convsigmoid_21           1 1 223 224 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600 9=4
Slice                    split_3                  1 2 224 225 226 -23300=2,40,-233 1=0
Split                    splitncnn_29             1 2 226 227 228
BinaryOp                 mul_26                   2 1 225 222 229 0=2
Concat                   cat_5                    2 1 219 229 230 0=0
Convolution              conv_65                  1 1 230 231 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=28800
TanH                     tanh_134                 1 1 231 232
BinaryOp                 mul_27                   2 1 227 232 233 0=2
BinaryOp                 sub_28                   1 1 228 234 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_29                   2 1 234 221 235 0=2
BinaryOp                 add_30                   2 1 235 233 236 0=0
Split                    splitncnn_30             1 2 236 237 out4
Concat                   cat_6                    2 1 216 237 239 0=0
Interp                   upsample_138             1 1 239 240 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    3 1 240 27 210 241 0=0
Convolution              convrelu_15              1 1 241 242 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=38520 9=1
Slice                    split_4                  1 2 242 243 244 -23300=2,20,-233 1=0
Split                    splitncnn_31             1 2 244 245 246
MemoryData               pnnx_fold_h.6            0 1 247 0=128 1=128 2=20
MemoryData               pnnx_fold_h.6_2          0 1 248 0=128 1=128 2=20
MemoryData               pnnx_fold_h.6_1          0 1 249 0=128 1=128 2=20
Concat                   cat_8                    2 1 245 247 250 0=0
Convolution              convsigmoid_22           1 1 250 251 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=4
Slice                    split_5                  1 2 251 252 253 -23300=2,20,-233 1=0
Split                    splitncnn_32             1 2 253 254 255
BinaryOp                 mul_31                   2 1 252 249 256 0=2
Concat                   cat_9                    2 1 246 256 257 0=0
Convolution              conv_68                  1 1 257 258 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=7200
TanH                     tanh_135                 1 1 258 259
BinaryOp                 mul_32                   2 1 254 259 260 0=2
BinaryOp                 sub_33                   1 1 255 261 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_34                   2 1 261 248 262 0=2
BinaryOp                 add_35                   2 1 262 260 263 0=0
Split                    splitncnn_33             1 2 263 264 out3
Concat                   cat_10                   2 1 243 264 266 0=0
Interp                   upsample_139             1 1 266 267 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   3 1 267 16 207 268 0=0
Convolution              convrelu_16              1 1 268 269 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=16992 9=1
Slice                    split_6                  1 2 269 270 271 -23300=2,16,-233 1=0
Split                    splitncnn_34             1 2 271 272 273
MemoryData               pnnx_fold_h.1            0 1 274 0=256 1=256 2=16
MemoryData               pnnx_fold_h.1_2          0 1 275 0=256 1=256 2=16
MemoryData               pnnx_fold_h.1_1          0 1 276 0=256 1=256 2=16
Concat                   cat_12                   2 1 272 274 277 0=0
Convolution              convsigmoid_23           1 1 277 278 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=4
Slice                    split_7                  1 2 278 279 280 -23300=2,16,-233 1=0
Split                    splitncnn_35             1 2 280 281 282
BinaryOp                 mul_36                   2 1 279 276 283 0=2
Concat                   cat_13                   2 1 273 283 284 0=0
Convolution              conv_71                  1 1 284 285 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
TanH                     tanh_136                 1 1 285 286
BinaryOp                 mul_37                   2 1 281 286 287 0=2
BinaryOp                 sub_38                   1 1 282 288 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_39                   2 1 288 275 289 0=2
BinaryOp                 add_40                   2 1 289 287 290 0=0
Split                    splitncnn_36             1 2 290 291 out2
Concat                   cat_14                   2 1 270 291 293 0=0
Interp                   upsample_140             1 1 293 294 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_15                   2 1 294 1 295 0=0
Convolution              convrelu_17              1 1 295 296 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5040 9=1
Convolution              convrelu_18              1 1 296 297 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              conv_74                  1 1 297 298 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Slice                    split_8                  1 2 298 299 300 -23300=2,3,1 1=0
BinaryOp                 add_41                   2 1 299 2 301 0=0
Clip                     clamp_151                1 1 301 out0 0=0.000000e+00 1=1.000000e+00
Clip                     clamp_150                1 1 300 out1 0=0.000000e+00 1=1.000000e+00
